stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_tim_ex.h
#define TIM_TIM2_ETR_GPIO           0x00000000UL                                                                 /*!< TIM2_ETR is connected to I/O           */
#define TIM_TIM2_ETR_COMP1          TIM_AF1_ETRSEL_0                                                             /*!< TIM2_ETR is connected to COMP1 OUT     */
#define TIM_TIM2_ETR_COMP2          TIM_AF1_ETRSEL_1                                                             /*!< TIM2_ETR is connected to COMP2 OUT     */
#define TIM_TIM2_ETR_MSIK           (TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)                                        /*!< TIM2_ETR is connected to MSIK          */
#define TIM_TIM2_ETR_HSI            TIM_AF1_ETRSEL_2                                                             /*!< TIM2_ETR is connected to MSIK          */
#define TIM_TIM2_ETR_TIM3_ETR       TIM_AF1_ETRSEL_3                                                             /*!< TIM2 ETR is connected to TIM3_ETR      */
#define TIM_TIM2_ETR_TIM4_ETR       (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_0)                                        /*!< TIM2 ETR is connected to TIM4_ETR      */
#define TIM_TIM2_ETR_LSE            (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)                     /*!< TIM2 ETR is connected to LSE           */
#define TIM_TIM2_ETR_USBFS_SOF      (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_0)                     /*!< TIM2_ETR is connected to USBFS OTG SOF */

#define TIM_TIM3_ETR_GPIO           0x00000000UL                                                                 /*!< TIM3_ETR is connected to I/O           */
#define TIM_TIM3_ETR_COMP1          TIM_AF1_ETRSEL_0                                                             /*!< TIM3_ETR is connected to COMP1 OUT     */
#define TIM_TIM3_ETR_COMP2          TIM_AF1_ETRSEL_1                                                             /*!< TIM3_ETR is connected to COMP2 OUT     */
#define TIM_TIM3_ETR_MSIK           (TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)                                        /*!< TIM3_ETR is connected to MSIK          */
#define TIM_TIM3_ETR_HSI            TIM_AF1_ETRSEL_2                                                             /*!< TIM3_ETR is connected to MSIK          */
#define TIM_TIM3_ETR_TIM2_ETR       TIM_AF1_ETRSEL_3                                                             /*!< TIM3 ETR is connected to TIM2 ETR      */
#define TIM_TIM3_ETR_TIM4_ETR       (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_0)                                         /*!< TIM3 ETR is connected to TIM4 ETR      */
#define TIM_TIM3_ETR_ADC1_AWD1      (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)                     /*!< TIM3 ETR is connected to ADC1 AWD1     */
#define TIM_TIM3_ETR_ADC1_AWD2      (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_2)                                        /*!< TIM3 ETR is connected to ADC1 AWD2     */
#define TIM_TIM3_ETR_ADC1_AWD3      (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_0)                     /*!< TIM3 ETR is connected to ADC1 AWD3     */

#define TIM_TIM4_ETR_GPIO           0x00000000UL                                                                 /*!< TIM4_ETR is connected to I/O           */
#define TIM_TIM4_ETR_COMP1          TIM_AF1_ETRSEL_0                                                             /*!< TIM4_ETR is connected to COMP1 OUT     */
#define TIM_TIM4_ETR_COMP2          TIM_AF1_ETRSEL_1                                                             /*!< TIM4_ETR is connected to COMP2 OUT     */
#define TIM_TIM4_ETR_MSIK           (TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)                                        /*!< TIM4_ETR is connected to MSIK          */
#define TIM_TIM4_ETR_HSI            TIM_AF1_ETRSEL_2                                                             /*!< TIM4_ETR is connected to HSI           */
#define TIM_TIM4_ETR_MSIS           (TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_0)                                        /*!< TIM4_ETR is connected to MSIS          */
#define TIM_TIM4_ETR_TIM3_ETR       TIM_AF1_ETRSEL_3                                                             /*!< TIM4 ETR is connected to TIM3_ETR      */

#if defined(TIM8)
#define TIM_TIM8_ETR_GPIO           0x00000000UL                                                                 /*!< TIM8_ETR is connected to I/O           */
#define TIM_TIM8_ETR_COMP1          TIM_AF1_ETRSEL_0                                                             /*!< TIM8_ETR is connected to COMP1 OUT     */
#define TIM_TIM8_ETR_COMP2          TIM_AF1_ETRSEL_1                                                             /*!< TIM8_ETR is connected to COMP2 OUT     */
#define TIM_TIM8_ETR_MSIK           (TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)                                        /*!< TIM8_ETR is connected to MSIK          */
#define TIM_TIM8_ETR_HSI            TIM_AF1_ETRSEL_2                                                             /*!< TIM8_ETR is connected to MSIK          */
#define TIM_TIM8_ETR_ADC1_AWD1      TIM_AF1_ETRSEL_3                                                             /*!< TIM8 ETR is connected to ADC1 AWD1     */
#define TIM_TIM8_ETR_ADC1_AWD2      (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_0)                                        /*!< TIM8 ETR is connected to ADC1 AWD2     */
#define TIM_TIM8_ETR_ADC1_AWD3      (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_1)                                        /*!< TIM8 ETR is connected to ADC1 AWD3     */
#define TIM_TIM8_ETR_ADC2_AWD1      (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)                     /*!< TIM8 ETR is connected to ADC2 AWD1     */
#define TIM_TIM8_ETR_ADC2_AWD2      (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_2)                                        /*!< TIM8 ETR is connected to ADC2 AWD2     */
#define TIM_TIM8_ETR_ADC2_AWD3      (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_0)                     /*!< TIM8 ETR is connected to ADC2 AWD3     */
#endif /* TIM8 */
/**
  * @}
  */

/** @defgroup TIMEx_Break_Input TIM Extended Break input
  * @{
  */
#define TIM_BREAKINPUT_BRK     0x00000001U                                      /*!< Timer break input  */
#define TIM_BREAKINPUT_BRK2    0x00000002U                                      /*!< Timer break2 input */
/**
  * @}
  */

/** @defgroup TIMEx_Break_Input_Source TIM Extended Break input source
  * @{
  */
#define TIM_BREAKINPUTSOURCE_BKIN     0x00000001U                               /*!< An external source (GPIO) is connected to the BKIN pin  */
#define TIM_BREAKINPUTSOURCE_COMP1    0x00000002U                               /*!< The COMP1 output is connected to the break input */
#define TIM_BREAKINPUTSOURCE_COMP2    0x00000004U                               /*!< The COMP2 output is connected to the break input */
/**
  * @}
  */

/** @defgroup TIMEx_Break_Input_Source_Enable TIM Extended Break input source enabling
  * @{
  */
#define TIM_BREAKINPUTSOURCE_DISABLE     0x00000000U                            /*!< Break input source is disabled */
#define TIM_BREAKINPUTSOURCE_ENABLE      0x00000001U                            /*!< Break input source is enabled */
/**
  * @}
  */

/** @defgroup TIMEx_Break_Input_Source_Polarity TIM Extended Break input polarity
  * @{
  */
#define TIM_BREAKINPUTSOURCE_POLARITY_LOW     0x00000001U                       /*!< Break input source is active low */
#define TIM_BREAKINPUTSOURCE_POLARITY_HIGH    0x00000000U                       /*!< Break input source is active_high */
/**
  * @}
  */

/** @defgroup TIMEx_Timer_Input_Selection TIM Extended Timer input selection
  * @{
  */
#define TIM_TIM1_TI1_GPIO                     0x00000000UL                                                   /*!< TIM1 TI1 is connected to GPIO */
#define TIM_TIM1_TI1_COMP1                    TIM_TISEL_TI1SEL_0                                             /*!< TIM1 TI1 is connected to COMP1 OUT */
#define TIM_TIM1_TI1_COMP2                    TIM_TISEL_TI1SEL_1                                             /*!< TIM1 TI1 is connected to COMP2 OUT */

#define TIM_TIM2_TI1_GPIO                     0x00000000UL                                                   /*!< TIM2 TI1 is connected to GPIO */
#define TIM_TIM2_TI1_COMP1                    TIM_TISEL_TI1SEL_0                                             /*!< TIM2 TI1 is connected to COMP1 OUT */
#define TIM_TIM2_TI1_COMP2                    TIM_TISEL_TI1SEL_1                                             /*!<  TIM2 TI1 is connected to COMP2 OUT */
#define TIM_TIM2_TI2_GPIO                     0x00000000UL                                                   /*!< TIM2 TI2 is connected to GPIO */
#define TIM_TIM2_TI2_COMP1                    TIM_TISEL_TI2SEL_0                                             /*!< TIM2 TI2 is connected to COMP1 OUT */
#define TIM_TIM2_TI2_COMP2                    TIM_TISEL_TI2SEL_1                                             /*!< TIM2 TI2 is connected to COMP2 OUT */
#define TIM_TIM2_TI4_GPIO                     0x00000000UL                                                   /*!< TIM2 TI4 is connected to GPIO */
#define TIM_TIM2_TI4_COMP1                    TIM_TISEL_TI4SEL_0                                             /*!< TIM2 TI4 is connected to COMP1 OUT */
#define TIM_TIM2_TI4_COMP2                    TIM_TISEL_TI4SEL_1                                             /*!< TIM2 TI4 is connected to COMP2 OUT */

#define TIM_TIM3_TI1_GPIO                     0x00000000UL                                                   /*!< TIM3 TI1 is connected to GPIO */
#define TIM_TIM3_TI1_COMP1                    TIM_TISEL_TI1SEL_0                                             /*!< TIM3 TI1 is connected to COMP1 OUT */
#define TIM_TIM3_TI1_COMP2                    TIM_TISEL_TI1SEL_1                                             /*!< TIM3 TI1 is connected to COMP2 OUT */
#define TIM_TIM3_TI2_GPIO                     0x00000000UL                                                   /*!< TIM3 TI2 is connected to GPIO */
#define TIM_TIM3_TI2_COMP1                    TIM_TISEL_TI2SEL_0                                             /*!< TIM3 TI2 is connected to COMP1 OUT */
#define TIM_TIM3_TI2_COMP2                    TIM_TISEL_TI2SEL_1                                             /*!< TIM3 TI2 is connected to COMP2 OUT */

#define TIM_TIM4_TI1_GPIO                     0x00000000UL                                                   /*!< TIM4 TI1 is connected to GPIO */
#define TIM_TIM4_TI1_COMP1                    TIM_TISEL_TI1SEL_0                                             /*!< TIM4 TI1 is connected to COMP1 OUT */
#define TIM_TIM4_TI1_COMP2                    TIM_TISEL_TI1SEL_1                                             /*!< TIM4 TI1 is connected to COMP2 OUT */
#define TIM_TIM4_TI2_GPIO                     0x00000000UL                                                   /*!< TIM4 TI2 is connected to GPIO */
#define TIM_TIM4_TI2_COMP1                    TIM_TISEL_TI2SEL_0                                             /*!< TIM3 TI2 is connected to COMP1 OUT */
#define TIM_TIM4_TI2_COMP2                    TIM_TISEL_TI2SEL_1                                             /*!< TIM3 sTI2 is connected to COMP2 OUT */

#if defined(TIM8)
#define TIM_TIM8_TI1_GPIO                     0x00000000UL                                                   /*!< TIM8 TI1 is connected to GPIO */
#define TIM_TIM8_TI1_COMP1                    TIM_TISEL_TI1SEL_0                                             /*!< TIM8 TI1 is connected to COMP1 OUT */
#define TIM_TIM8_TI1_COMP2                    TIM_TISEL_TI1SEL_1                                             /*!< TIM8 TI1 is connected to COMP2 OUT */
#endif /* TIM8 */

#if defined(TIM12)
#define TIM_TIM12_TI1_GPIO                    0x00000000UL                                                   /*!< TIM12 TI1 is connected to GPIO */
#define TIM_TIM12_TI1_LSE                     TIM_TISEL_TI1SEL_0                                             /*!< TIM12 TI1 is connected to LSE */
#define TIM_TIM12_TI1_COMP1                   TIM_TISEL_TI1SEL_1                                             /*!< TIM12 TI1 is connected to COMP1 OUT */
#define TIM_TIM12_TI1_COMP2                   (TIM_TISEL_TI1SEL_0 | TIM_TISEL_TI1SEL_1)                      /*!< TIM12 TI1 is connected to COMP2 OUT */
#define TIM_TIM12_TI1_I3C1_IBIACK             TIM_TISEL_TI1SEL_2                                             /*!< TIM12 TI1 is connected to I3C1 IBIACK */
#define TIM_TIM12_TI2_GPIO                    0x00000000UL                                                   /*!< TIM12 TI2 is connected to GPIO */
#define TIM_TIM12_TI2_COMP2                   TIM_TISEL_TI2SEL_0                                             /*!< TIM12 TI1 is connected to COMP2 OUT */
#define TIM_TIM12_TI2_I3C2_IBIACK             TIM_TISEL_TI2SEL_1                                             /*!< TIM12 TI1 is connected to I3C2 IBIACK */
#endif /* TIM12 */

