stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_tim_ex.h
#define TIM_TIM15_TI1_GPIO                    0x00000000UL                                                   /*!< TIM15 TI1 is connected to GPIO */
#define TIM_TIM15_TI1_LSE                     TIM_TISEL_TI1SEL_0                                             /*!< TIM15 TI1 is connected to LSE */
#define TIM_TIM15_TI1_COMP1                   TIM_TISEL_TI1SEL_1                                             /*!< TIM15 TI1 is connected to COMP1 OUT */
#define TIM_TIM15_TI1_COMP2                   (TIM_TISEL_TI1SEL_0 | TIM_TISEL_TI1SEL_1)                      /*!< TIM15 TI1 is connected to COMP2 OUT */
#define TIM_TIM15_TI1_I3C1_IBIACK             TIM_TISEL_TI1SEL_2                                             /*!< TIM15 TI1 is connected to I3C1 IBIACK */
#define TIM_TIM15_TI2_GPIO                    0x00000000UL                                                   /*!< TIM15 TI2 is connected to GPIO */
#define TIM_TIM15_TI2_COMP2                   TIM_TISEL_TI2SEL_0                                             /*!< TIM15 TI1 is connected to COMP2 OUT */
#define TIM_TIM15_TI2_I3C2_IBIACK             TIM_TISEL_TI2SEL_1                                             /*!< TIM15 TI1 is connected to I3C2 IBIACK */

#define TIM_TIM16_TI1_GPIO                    0x00000000UL                                                   /*!< TIM16 TI1 is connected to GPIO */
#define TIM_TIM16_TI1_MCO                     TIM_TISEL_TI1SEL_1                                             /*!< TIM16 TI1 is connected to MCO */
#define TIM_TIM16_TI1_HSE_32                  (TIM_TISEL_TI1SEL_0 | TIM_TISEL_TI1SEL_1)                      /*!< TIM16 TI1 is connected to HSE DIV 32 */
#define TIM_TIM16_TI1_RTC_WKUP                TIM_TISEL_TI1SEL_2                                             /*!< TIM16 TI1 is connected to RTC wakeup interrupt */
#define TIM_TIM16_TI1_LSE                     (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_0)                      /*!< TIM16 TI1 is connected to LSE */
#define TIM_TIM16_TI1_LSI                     (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1)                      /*!< TIM16 TI1 is connected to LSI */
#define TIM_TIM16_TI1_MSI_1024                (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0) /*!< TIM16 TI1 is connected to MSI DIV 1024 */
#define TIM_TIM16_TI1_MSI_4                   TIM_TISEL_TI1SEL_3                                             /*!< TIM16 TI1 is connected to MSI DIV 4 */
#define TIM_TIM16_TI1_HSI_256                 (TIM_TISEL_TI1SEL_3 | TIM_TISEL_TI1SEL_0)                      /*!< TIM16 TI1 is connected to MSI DIV 256 */
#define TIM_TIM16_TI1_I3C1_IBIACK             (TIM_TISEL_TI1SEL_3 | TIM_TISEL_TI1SEL_1)                      /*!< TIM16 TI1 is connected to I3C1 IBIACK */

#define TIM_TIM17_TI1_GPIO                    0x00000000UL                                                   /*!< TIM17 TI1 is connected to GPIO */
#define TIM_TIM17_TI1_MCO                     TIM_TISEL_TI1SEL_1                                             /*!< TIM17 TI1 is connected to MCO */
#define TIM_TIM17_TI1_HSE_32                  (TIM_TISEL_TI1SEL_0 | TIM_TISEL_TI1SEL_1)                      /*!< TIM17 TI1 is connected to HSE DIV 32 */
#define TIM_TIM17_TI1_RTC_WKUP                TIM_TISEL_TI1SEL_2                                             /*!< TIM17 TI1 is connected to RTC wakeup interrupt */
#define TIM_TIM17_TI1_LSE                     (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_0)                      /*!< TIM17 TI1 is connected to LSE */
#define TIM_TIM17_TI1_LSI                     (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1)                      /*!< TIM17 TI1 is connected to LSI */
#define TIM_TIM17_TI1_MSI_1024                (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0) /*!< TIM17 TI1 is connected to MSI DIV 1024 */
#define TIM_TIM17_TI1_MSI_4                   TIM_TISEL_TI1SEL_3                                             /*!< TIM17 TI1 is connected to MSI DIV 4 */
#define TIM_TIM17_TI1_HSI_256                 (TIM_TISEL_TI1SEL_3 | TIM_TISEL_TI1SEL_0)                      /*!< TIM17 TI1 is connected to MSI DIV 256 */
#define TIM_TIM17_TI1_I3C2_IBIACK             (TIM_TISEL_TI1SEL_3 | TIM_TISEL_TI1SEL_1)                      /*!< TIM17 TI1 is connected to I3C2 IBIACK */
/**
  * @}
  */

/** @defgroup TIMEx_SMS_Preload_Enable TIM Extended Bitfield SMS preload enabling
  * @{
  */
#define TIM_SMS_PRELOAD_SOURCE_UPDATE     0x00000000U                            /*!< Prelaod of SMS bitfield is disabled */
#define TIM_SMS_PRELOAD_SOURCE_INDEX      TIM_SMCR_SMSPS                         /*!< Preload of SMS bitfield is enabled  */
/**
  * @}
  */

/** @defgroup TIMEx_Encoder_Index_Blanking TIM Extended Encoder index blanking
  * @{
  */
#define TIM_ENCODERINDEX_BLANKING_DISABLE   0x00000000U     /*!< Encoder index blanking is disabled */
#define TIM_ENCODERINDEX_BLANKING_TI3       TIM_ECR_IBLK_0     /*!< Encoder index blanking is enabled on TI3 */
#define TIM_ENCODERINDEX_BLANKING_TI4       TIM_ECR_IBLK_1     /*!< Encoder index blanking is enabled on TI4 */

/**
  * @}
  */

/** @defgroup TIMEx_Encoder_Index_Position TIM Extended Encoder index position
  * @{
  */
#define TIM_ENCODERINDEX_POSITION_00        0x00000000U                           /*!< Encoder index position is AB=00 */
#define TIM_ENCODERINDEX_POSITION_01        TIM_ECR_IPOS_0                        /*!< Encoder index position is AB=01 */
#define TIM_ENCODERINDEX_POSITION_10        TIM_ECR_IPOS_1                        /*!< Encoder index position is AB=10 */
#define TIM_ENCODERINDEX_POSITION_11        (TIM_ECR_IPOS_1 | TIM_ECR_IPOS_0)     /*!< Encoder index position is AB=11 */
#define TIM_ENCODERINDEX_POSITION_0         0x00000000U                           /*!< In directional clock mode or clock plus direction mode, index resets the counter when clock is 0 */
#define TIM_ENCODERINDEX_POSITION_1         TIM_ECR_IPOS_0                        /*!< In directional clock mode or clock plus direction mode, index resets the counter when clock is 1 */
/**
  * @}
  */

/** @defgroup TIMEx_Encoder_Index_Direction TIM Extended Encoder index direction
  * @{
  */
#define TIM_ENCODERINDEX_DIRECTION_UP_DOWN 0x00000000U        /*!< Index resets the counter whatever the direction  */
#define TIM_ENCODERINDEX_DIRECTION_UP      TIM_ECR_IDIR_0     /*!< Index resets the counter when up-counting only   */
#define TIM_ENCODERINDEX_DIRECTION_DOWN    TIM_ECR_IDIR_1     /*!< Index resets the counter when down-counting only */
/**
  * @}
  */

/** @defgroup TIMEx_Encoder_Index_Polarity TIM Extended Encoder index polarity
  * @{
  */
#define TIM_ENCODERINDEX_POLARITY_INVERTED           TIM_ETRPOLARITY_INVERTED      /*!< Polarity for ETRx pin */
#define TIM_ENCODERINDEX_POLARITY_NONINVERTED        TIM_ETRPOLARITY_NONINVERTED   /*!< Polarity for ETRx pin */
/**
  * @}
  */

/** @defgroup TIMEx_Encoder_Index_Prescaler TIM Extended Encodder index prescaler
  * @{
  */
#define TIM_ENCODERINDEX_PRESCALER_DIV1              TIM_ETRPRESCALER_DIV1         /*!< No prescaler is used                                                   */
#define TIM_ENCODERINDEX_PRESCALER_DIV2              TIM_ETRPRESCALER_DIV2         /*!< Prescaler for External ETR pin: Capture performed once every 2 events. */
#define TIM_ENCODERINDEX_PRESCALER_DIV4              TIM_ETRPRESCALER_DIV4         /*!< Prescaler for External ETR pin: Capture performed once every 4 events. */
#define TIM_ENCODERINDEX_PRESCALER_DIV8              TIM_ETRPRESCALER_DIV8         /*!< Prescaler for External ETR pin: Capture performed once every 8 events. */
/**
  * @}
  */

/**
  * @}
  */
/* End of exported constants -------------------------------------------------*/

/* Exported macro ------------------------------------------------------------*/
/** @defgroup TIMEx_Exported_Macros TIM Extended Exported Macros
  * @{
  */

/**
  * @brief  HELPER macro calculating the prescaler value to achieve the required counter clock frequency.
  * @note   ex: @ref __HAL_TIM_CALC_PSC(80000000, 1000000);
  * @param  __TIMCLK__ timer input clock frequency (in Hz)
  * @param  __CNTCLK__ counter clock frequency (in Hz)
  * @retval Prescaler value  (between Min_Data=0 and Max_Data=65535)
  */
#define __HAL_TIM_CALC_PSC(__TIMCLK__, __CNTCLK__)   \
  ((__TIMCLK__) >= (__CNTCLK__)) ? (uint32_t)((__TIMCLK__)/(__CNTCLK__) - 1U) : 0U

/**
  * @brief  HELPER macro calculating the auto-reload value to achieve the required output signal frequency.
  * @note   ex: @ref __HAL_TIM_CALC_PERIOD(1000000, 0, 10000);
  * @param  __TIMCLK__ timer input clock frequency (in Hz)
  * @param  __PSC__ prescaler
  * @param  __FREQ__ output signal frequency (in Hz)
  * @retval  Auto-reload value  (between Min_Data=0 and Max_Data=65535)
  */
#define __HAL_TIM_CALC_PERIOD(__TIMCLK__, __PSC__, __FREQ__) \
  (((__TIMCLK__)/((__PSC__) + 1U)) >= (__FREQ__)) ? ((__TIMCLK__)/((__FREQ__) * ((__PSC__) + 1U)) - 1U) : 0U

/**
  * @brief  HELPER macro calculating the auto-reload value, with dithering feature enabled, to achieve the required
  *         output signal frequency.
  * @note   ex: @ref __HAL_TIM_CALC_PERIOD_DITHER(1000000, 0, 10000);
  * @note   This macro should be used only if dithering is already enabled
  * @param  __TIMCLK__ timer input clock frequency (in Hz)
  * @param  __PSC__ prescaler
  * @param  __FREQ__ output signal frequency (in Hz)
  * @retval  Auto-reload value  (between Min_Data=0 and Max_Data=65519)
  */
#define __HAL_TIM_CALC_PERIOD_DITHER(__TIMCLK__, __PSC__, __FREQ__) \
  (((__TIMCLK__)/((__PSC__) + 1U)) >= (__FREQ__)) ? \
  (uint32_t)(((uint64_t)(__TIMCLK__)*16/((__FREQ__) * ((__PSC__) + 1U)) - 16U)) : 0U

/**
  * @brief  HELPER macro calculating the compare value required to achieve the required timer output compare
  *         active/inactive delay.
  * @note   ex: @ref __HAL_TIM_CALC_PULSE(1000000, 0, 10);
  * @param  __TIMCLK__ timer input clock frequency (in Hz)
  * @param  __PSC__ prescaler
  * @param  __DELAY__ timer output compare active/inactive delay (in us)
  * @retval Compare value  (between Min_Data=0 and Max_Data=65535)
  */
#define __HAL_TIM_CALC_PULSE(__TIMCLK__, __PSC__, __DELAY__)  \
  ((uint32_t)(((uint64_t)(__TIMCLK__) * (uint64_t)(__DELAY__)) \
              / ((uint64_t)1000000U * (uint64_t)((__PSC__) + 1U))))

/**
  * @brief  HELPER macro calculating the compare value, with dithering feature enabled, to achieve the required timer
  *         output compare active/inactive delay.
  * @note   ex: @ref __HAL_TIM_CALC_PULSE_DITHER(1000000, 0, 10);
  * @note   This macro should be used only if dithering is already enabled
  * @param  __TIMCLK__ timer input clock frequency (in Hz)
  * @param  __PSC__ prescaler
  * @param  __DELAY__ timer output compare active/inactive delay (in us)
  * @retval Compare value  (between Min_Data=0 and Max_Data=65519)
  */
#define __HAL_TIM_CALC_PULSE_DITHER(__TIMCLK__, __PSC__, __DELAY__)  \
  ((uint32_t)(((uint64_t)(__TIMCLK__) * (uint64_t)(__DELAY__) * 16U) \
              / ((uint64_t)1000000U * (uint64_t)((__PSC__) + 1U))))

/**
  * @brief  HELPER macro calculating the auto-reload value to achieve the required pulse duration
  *        (when the timer operates in one pulse mode).
  * @note   ex: @ref __HAL_TIM_CALC_PERIOD_BY_DELAY(1000000, 0, 10, 20);
  * @param  __TIMCLK__ timer input clock frequency (in Hz)
  * @param  __PSC__ prescaler
  * @param  __DELAY__ timer output compare active/inactive delay (in us)
  * @param  __PULSE__ pulse duration (in us)
  * @retval Auto-reload value  (between Min_Data=0 and Max_Data=65535)
  */
#define __HAL_TIM_CALC_PERIOD_BY_DELAY(__TIMCLK__, __PSC__, __DELAY__, __PULSE__)  \
  ((uint32_t)(__HAL_TIM_CALC_PULSE((__TIMCLK__), (__PSC__), (__PULSE__)) \
              + __HAL_TIM_CALC_PULSE((__TIMCLK__), (__PSC__), (__DELAY__))))

/**
  * @brief  HELPER macro calculating the auto-reload value, with dithering feature enabled, to achieve the required
  *         pulse duration (when the timer operates in one pulse mode).
  * @note   ex: @ref __HAL_TIM_CALC_PERIOD_DITHER_BY_DELAY(1000000, 0, 10, 20);
  * @note   This macro should be used only if dithering is already enabled
  * @param  __TIMCLK__ timer input clock frequency (in Hz)
  * @param  __PSC__ prescaler
  * @param  __DELAY__ timer output compare active/inactive delay (in us)
  * @param  __PULSE__ pulse duration (in us)
  * @retval Auto-reload value  (between Min_Data=0 and Max_Data=65519)
  */
#define __HAL_TIM_CALC_PERIOD_DITHER_BY_DELAY(__TIMCLK__, __PSC__, __DELAY__, __PULSE__)  \
  ((uint32_t)(__HAL_TIM_CALC_PULSE_DITHER((__TIMCLK__), (__PSC__), (__PULSE__)) \
              + __HAL_TIM_CALC_PULSE_DITHER((__TIMCLK__), (__PSC__), (__DELAY__))))

/**
  * @}
  */
/* End of exported macro -----------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/
/** @defgroup TIMEx_Private_Macros TIM Extended Private Macros
  * @{
  */
#if defined(TIM8)
#define IS_TIM_REMAP(INSTANCE, TIM_REMAP)                                     \
  ((((INSTANCE) == TIM1)  && (((TIM_REMAP) == TIM_TIM1_ETR_GPIO)           || \
                              ((TIM_REMAP) == TIM_TIM1_ETR_COMP1)          || \
                              ((TIM_REMAP) == TIM_TIM1_ETR_COMP2)          || \
                              ((TIM_REMAP) == TIM_TIM1_ETR_MSIK)           || \
                              ((TIM_REMAP) == TIM_TIM1_ETR_HSI)            || \
                              ((TIM_REMAP) == TIM_TIM1_ETR_ADC1_AWD1)      || \
                              ((TIM_REMAP) == TIM_TIM1_ETR_ADC1_AWD2)      || \
                              ((TIM_REMAP) == TIM_TIM1_ETR_ADC1_AWD3)      || \
                              ((TIM_REMAP) == TIM_TIM1_ETR_ADC2_AWD1)      || \
                              ((TIM_REMAP) == TIM_TIM1_ETR_ADC2_AWD2)      || \
                              ((TIM_REMAP) == TIM_TIM1_ETR_ADC2_AWD3)))    || \
   (((INSTANCE) == TIM2)  && (((TIM_REMAP) == TIM_TIM2_ETR_GPIO)           || \
                              ((TIM_REMAP) == TIM_TIM2_ETR_COMP1)          || \
                              ((TIM_REMAP) == TIM_TIM2_ETR_COMP2)          || \
                              ((TIM_REMAP) == TIM_TIM2_ETR_MSIK)           || \
                              ((TIM_REMAP) == TIM_TIM2_ETR_HSI)            || \
                              ((TIM_REMAP) == TIM_TIM2_ETR_TIM3_ETR)       || \
                              ((TIM_REMAP) == TIM_TIM2_ETR_TIM4_ETR)       || \
                              ((TIM_REMAP) == TIM_TIM2_ETR_LSE)            || \
                              ((TIM_REMAP) == TIM_TIM2_ETR_USBFS_SOF)))    || \
   (((INSTANCE) == TIM3)  && (((TIM_REMAP) == TIM_TIM3_ETR_GPIO)           || \
                              ((TIM_REMAP) == TIM_TIM3_ETR_COMP1)          || \
                              ((TIM_REMAP) == TIM_TIM3_ETR_COMP2)          || \
                              ((TIM_REMAP) == TIM_TIM3_ETR_MSIK)           || \
                              ((TIM_REMAP) == TIM_TIM3_ETR_HSI)            || \
                              ((TIM_REMAP) == TIM_TIM3_ETR_TIM2_ETR)       || \
                              ((TIM_REMAP) == TIM_TIM3_ETR_TIM4_ETR)       || \
                              ((TIM_REMAP) == TIM_TIM3_ETR_ADC1_AWD1)      || \
                              ((TIM_REMAP) == TIM_TIM3_ETR_ADC1_AWD2)      || \
                              ((TIM_REMAP) == TIM_TIM3_ETR_ADC1_AWD3)))    || \
   (((INSTANCE) == TIM4)  && (((TIM_REMAP) == TIM_TIM4_ETR_GPIO)           || \
                              ((TIM_REMAP) == TIM_TIM4_ETR_COMP1)          || \
                              ((TIM_REMAP) == TIM_TIM4_ETR_COMP2)          || \
                              ((TIM_REMAP) == TIM_TIM4_ETR_MSIK)           || \
                              ((TIM_REMAP) == TIM_TIM4_ETR_HSI)            || \
                              ((TIM_REMAP) == TIM_TIM4_ETR_MSIS)           || \
                              ((TIM_REMAP) == TIM_TIM4_ETR_TIM3_ETR)))     || \
   (((INSTANCE) == TIM8)  && (((TIM_REMAP) == TIM_TIM8_ETR_GPIO)           || \
                              ((TIM_REMAP) == TIM_TIM8_ETR_COMP1)          || \
                              ((TIM_REMAP) == TIM_TIM8_ETR_COMP2)          || \
                              ((TIM_REMAP) == TIM_TIM8_ETR_MSIK)           || \
                              ((TIM_REMAP) == TIM_TIM8_ETR_HSI)            || \
                              ((TIM_REMAP) == TIM_TIM8_ETR_ADC1_AWD1)      || \
                              ((TIM_REMAP) == TIM_TIM8_ETR_ADC1_AWD2)      || \
                              ((TIM_REMAP) == TIM_TIM8_ETR_ADC1_AWD3)      || \
                              ((TIM_REMAP) == TIM_TIM8_ETR_ADC2_AWD1)      || \
                              ((TIM_REMAP) == TIM_TIM8_ETR_ADC2_AWD2)      || \
                              ((TIM_REMAP) == TIM_TIM8_ETR_ADC2_AWD3))))
#else
#define IS_TIM_REMAP(INSTANCE, TIM_REMAP)                                     \
  ((((INSTANCE) == TIM1)  && (((TIM_REMAP) == TIM_TIM1_ETR_GPIO)           || \
                              ((TIM_REMAP) == TIM_TIM1_ETR_COMP1)          || \
                              ((TIM_REMAP) == TIM_TIM1_ETR_COMP2)          || \
                              ((TIM_REMAP) == TIM_TIM1_ETR_MSIK)           || \
                              ((TIM_REMAP) == TIM_TIM1_ETR_HSI)            || \
                              ((TIM_REMAP) == TIM_TIM1_ETR_ADC1_AWD1)      || \
                              ((TIM_REMAP) == TIM_TIM1_ETR_ADC1_AWD2)      || \
                              ((TIM_REMAP) == TIM_TIM1_ETR_ADC1_AWD3)      || \
                              ((TIM_REMAP) == TIM_TIM1_ETR_ADC2_AWD1)      || \
                              ((TIM_REMAP) == TIM_TIM1_ETR_ADC2_AWD2)      || \
                              ((TIM_REMAP) == TIM_TIM1_ETR_ADC2_AWD3)))    || \
   (((INSTANCE) == TIM2)  && (((TIM_REMAP) == TIM_TIM2_ETR_GPIO)           || \
                              ((TIM_REMAP) == TIM_TIM2_ETR_COMP1)          || \
                              ((TIM_REMAP) == TIM_TIM2_ETR_COMP2)          || \
                              ((TIM_REMAP) == TIM_TIM2_ETR_MSIK)           || \
                              ((TIM_REMAP) == TIM_TIM2_ETR_HSI)            || \
                              ((TIM_REMAP) == TIM_TIM2_ETR_TIM3_ETR)       || \
                              ((TIM_REMAP) == TIM_TIM2_ETR_TIM4_ETR)       || \
                              ((TIM_REMAP) == TIM_TIM2_ETR_LSE)            || \
                              ((TIM_REMAP) == TIM_TIM2_ETR_USBFS_SOF)))    || \
   (((INSTANCE) == TIM3)  && (((TIM_REMAP) == TIM_TIM3_ETR_GPIO)           || \
                              ((TIM_REMAP) == TIM_TIM3_ETR_COMP1)          || \
                              ((TIM_REMAP) == TIM_TIM3_ETR_COMP2)          || \
                              ((TIM_REMAP) == TIM_TIM3_ETR_MSIK)           || \
                              ((TIM_REMAP) == TIM_TIM3_ETR_HSI)            || \
                              ((TIM_REMAP) == TIM_TIM3_ETR_TIM2_ETR)       || \
                              ((TIM_REMAP) == TIM_TIM3_ETR_TIM4_ETR)       || \
                              ((TIM_REMAP) == TIM_TIM3_ETR_ADC1_AWD1)      || \
                              ((TIM_REMAP) == TIM_TIM3_ETR_ADC1_AWD2)      || \
                              ((TIM_REMAP) == TIM_TIM3_ETR_ADC1_AWD3)))    || \
   (((INSTANCE) == TIM4)  && (((TIM_REMAP) == TIM_TIM4_ETR_GPIO)           || \
                              ((TIM_REMAP) == TIM_TIM4_ETR_COMP1)          || \
                              ((TIM_REMAP) == TIM_TIM4_ETR_COMP2)          || \
                              ((TIM_REMAP) == TIM_TIM4_ETR_MSIK)           || \
                              ((TIM_REMAP) == TIM_TIM4_ETR_HSI)            || \
                              ((TIM_REMAP) == TIM_TIM4_ETR_MSIS)           || \
                              ((TIM_REMAP) == TIM_TIM4_ETR_TIM3_ETR))))
#endif /* TIM8 */

#define IS_TIM_BREAKINPUT(__BREAKINPUT__)  (((__BREAKINPUT__) == TIM_BREAKINPUT_BRK)  || \
                                            ((__BREAKINPUT__) == TIM_BREAKINPUT_BRK2))

